app/views/projects/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."project_id" = ?  [["project_id", 1]]
SELECT COUNT(*) FROM "events" WHERE "events"."project_id" = ?  [["project_id", 1]]
---

<% if @project.events.size > 0 %>