app/controllers/events_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."project_id" = ? AND "events"."id" = ? LIMIT ?  [["project_id", 4], ["id", 10], ["LIMIT", 1]]
---
    def edit
      @project = Project.find(params[:project_id])
      @event = @project.events.find(params[:id])

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
INSERT INTO "events" ("event_type", "event_start", "event_duration", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["event_type", "BTHF Tuning"], ["event_start", "1990-01-01"], ["event_duration", 12], ["project_id", 1], ["created_at", "2018-10-18 19:25:41.006566"], ["updated_at", "2018-10-18 19:25:41.006566"]]
---
    def create
        @project = Project.find(params[:project_id])
        @event = @project.events.create(event_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
UPDATE "events" SET "event_start" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["event_start", "2018-01-10"], ["updated_at", "2018-10-18 19:09:18.250363"], ["id", 10]]
---
    def update
      @project = Project.find(params[:project_id])
      @event = Event.find(params[:id])

      if @event.update(event_params)

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "events".* FROM "events" WHERE "events"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = ?  [["id", 1]]
---
    def destroy
      @project = Project.find(params[:project_id])
      @event = Event.find(params[:id])

      @event.destroy