app/controllers/projects_controller.rb

INSERT INTO "projects" ("project_name", "project_tier1", "project_oem", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["project_name", "EB MIB3"], ["project_tier1", "Elektrobit"], ["project_oem", "Audi|PAG"], ["created_at", "2018-10-12 11:47:04.996372"], ["updated_at", "2018-10-12 11:47:04.996372"]]
---
    def create
        #render plain: params[:project].inspect
        @project = Project.new(project_params)
        @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "projects" SET "project_tier1" = ?, "project_oem" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["project_tier1", "ART Spa"], ["project_oem", "Ferrari"], ["updated_at", "2018-10-12 08:26:25.580981"], ["id", 2]]
---
    def update
        @project = Project.find(params[:id])

        if @project.update(project_params)